# NoPanelsLoaded Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..NoPanelsLoaded Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
No Curtain Panel Families loaded. Can't make arced Curtain Wall.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoPanelsLoaded { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoPanelsLoaded As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoPanelsLoaded {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace